tap "hashicorp/tap"
tap "heroku/brew"

# Core CLI.
brew "bat"
brew "coreutils"
brew "direnv"
brew "dockutil"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "jq"
brew "just"
brew "mise"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "tmux"
brew "uv"
brew "vim"
brew "watchman"
brew "wget"
brew "zoxide"
brew "zsh"

# Language and cloud tooling.
brew "awscli"
brew "buf"
brew "cmake"
brew "ctags"
brew "firebase-cli"
brew "go"
brew "golangci-lint"
brew "node"
brew "openapi-generator"
brew "openjdk@21"
brew "pgformatter"
brew "pnpm"
brew "postgresql@16"
brew "python@3.14"
brew "ruby"
brew "hashicorp/tap/vault", trusted: true
brew "heroku/brew/heroku", trusted: true

# Secrets management.
cask "1password"
cask "1password-cli"

# Agent-heavy coding setup.
# Claude desktop app and Claude Code CLI.
cask "claude"
cask "claude-code"
cask "cmux"
# Codex CLI and Codex desktop app.
cask "codex"
cask "codex-app"
cask "cursor"
cask "ghostty"
cask "visual-studio-code"
cask "zed"

# Daily apps.
cask "airtable"
cask "alfred"
cask "discord"
cask "docker-desktop"
cask "figma"
cask "gcloud-cli"
cask "google-chrome"
cask "linear"
cask "microsoft-teams"
cask "notion"
cask "postico"
cask "postman"
cask "signal"
cask "slack"
cask "spotify"
cask "superhuman"
cask "telegram"
cask "vlc"
cask "wispr-flow"
cask "zoom"
